#+TITLE: First org doc
#+DESCRIPTION: Kyle's first org doc
#+MAINTAINER: Kyle Gortych

* Table
** sample
*** after typing columns it acts like excel doc
*** spc-m-b- - inserts ASCII table header border

      | one    | two    | three  | four   |
      |--------+--------+--------+--------|
      | sample | sample | sample | sample |

* Snippets
** spc-i-s
** C-c C-c runs
** <s tab completion of snippet
*** examples
#+begin_src python
def foo(x):
    if x>0:
        return x+1
    else:
        return x-1

return foo(5)
#+end_src

#+RESULTS:
: 6

#+begin_src rust
fn get_color_and_id(index: usize) -> (String, i32) {
    match index {
        1 | 2 => ("blue".to_string(), 2),
        _ => ("red".to_string(), 10),
    }
}

fn main() {
    // Get tuple, and then access its 0 and 1 fields.
    let result = get_color_and_id(0);
    println!("{} {}", result.0, result.1);

    // Get parts of tuple directly in assignment.
    let (color, id) = get_color_and_id(2);
    println!("{} {}", color, id);
}
#+end_src

#+RESULTS:
: red 10
: blue 2
